In [6]:
import pandas as pd

In [8]:
data_xls = pd.ExcelFile('data/battledeath.xlsx')

In [11]:
data_xls.sheet_names

['2002', '2004']

In [12]:
data_2002 = data_xls.parse(0, skiprows=[1], usecols=[0], names=['rename_col1','rename_col2'])

data_2002

             rename_col1
0                Albania
1                Algeria
2                Andorra
3                 Angola
4    Antigua and Barbuda
..                   ...
186            Venezuela
187              Vietnam
188          Yemen, Rep.
189               Zambia
190             Zimbabwe

[191 rows x 1 columns]

In [22]:
data_2002 = data_xls.parse(0, skiprows=[1])

data_2002

    War, age-adjusted mortality due to       2002
0                              Albania   0.128908
1                              Algeria  18.314120
2                              Andorra   0.000000
3                               Angola  18.964560
4                  Antigua and Barbuda   0.000000
..                                 ...        ...
186                          Venezuela   0.000000
187                            Vietnam   0.040222
188                        Yemen, Rep.   0.074510
189                             Zambia   0.044548
190                           Zimbabwe  33.796200

[191 rows x 2 columns]